In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [4]:
df.describe() #설명하다

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

In [6]:
df.race.unique() #유일한 인종의 값 list

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [11]:
a = enumerate(['A','B','C'])
a,dict(a)

(<enumerate at 0x7f851fbb9dc0>, {0: 'A', 1: 'B', 2: 'C'})

In [12]:
np.array(dict(enumerate(df["race"].unique())))
#df["race"].unique()
#dict(enumerate(df["race"].unique()))

array({0: 'white', 1: 'other', 2: 'hispanic', 3: 'black'}, dtype=object)

In [17]:
value = list(map(int, np.array(list(enumerate(df["race"].unique())))[:, 0].tolist())) #Label index값 추출. unique()를 이용하면 label이 가능.
key = np.array(list(enumerate(df["race"].unique())), dtype=str)[:, 1].tolist() #Label 값 추출.
value, key #Label index와 Label 값을 각각 추출

([0, 1, 2, 3], ['white', 'other', 'hispanic', 'black'])

In [18]:
df["race"].replace(to_replace=key, value=value, inplace=True) #Label str -> Index값으로 변환.

In [20]:
value = list(map(int, np.array(list(enumerate(df["sex"].unique())))[:, 0].tolist())) #성별에 대해서도 동일하게 적용
key = np.array(list(enumerate(df["sex"].unique())), dtype=str)[:, 1].tolist()
value, key

([0, 1], ['male', 'female'])

In [21]:
df["sex"].replace(to_replace=key, value=value, inplace=True) #"sex"와 "race"의 column의 index labelling.
df.head(5)

           earn  height  sex  race  ed  age
0  79571.299011   73.89    0     0  16   49
1  96396.988643   66.23    1     0  16   62
2  48710.666947   63.77    1     0  16   33
3  80478.096153   63.22    1     1  16   95
4  82089.345498   63.08    1     0  17   43

In [22]:
df.sum(axis=0)

earn      4.474344e+07
height    9.183125e+04
sex       8.590000e+02
race      5.610000e+02
ed        1.841600e+04
age       6.250800e+04
dtype: float64

In [23]:
df.sum(axis=1)

0       79710.189011
1       96542.218643
2       48824.436947
3       80654.316153
4       82213.425498
            ...
1374    30290.060363
1375    25019.829514
1376    13824.311312
1377    95563.664410
1378     9686.681857
Length: 1379, dtype: float64

In [28]:
df.isnull()

       earn  height    sex   race     ed    age
0     False   False  False  False  False  False
1     False   False  False  False  False  False
2     False   False  False  False  False  False
3     False   False  False  False  False  False
4     False   False  False  False  False  False
...     ...     ...    ...    ...    ...    ...
1374  False   False  False  False  False  False
1375  False   False  False  False  False  False
1376  False   False  False  False  False  False
1377  False   False  False  False  False  False
1378  False   False  False  False  False  False

[1379 rows x 6 columns]

In [26]:
df.isnull(1)

TypeError: isnull() takes 1 positional argument but 2 were given

In [29]:
df.isnull().sum()

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

In [30]:
df.sort_values(["age", "earn"], ascending=True).head(10) #column값을 기준으로 데이터를 sorting함. (ascending -> 오름차순)

             earn  height  sex  race  ed  age
1038   -56.321979   67.81    0     2  10   22
800    -27.876819   72.29    0     0  12   22
963    -25.655260   68.90    0     0  12   22
1105   988.565070   64.71    1     0  12   22
801   1000.221504   64.09    1     0  12   22
862   1002.023843   66.59    1     0  12   22
933   1007.994941   68.26    1     0  12   22
988   1578.542814   64.53    0     0  12   22
522   1955.168187   69.87    1     3  12   22
765   2581.870402   64.79    1     0  12   22

In [31]:
df.age.corr(df.earn) #age와 earn의 상관관계

0.07400349177836056

In [32]:
df.age.cov(df.earn) #age와 eran의 공분산

36523.69921040891

In [33]:
df.corrwith(df.earn) #특정 데이터와의 correlations. earn과 연관관계가 많은 것.

earn      1.000000
height    0.291600
sex      -0.337328
race     -0.063977
ed        0.350374
age       0.074003
dtype: float64

In [34]:
df.cumsum()

              earn    height  sex  race     ed    age
0     7.957130e+04     73.89    0     0     16     49
1     1.759683e+05    140.12    1     0     32    111
2     2.246790e+05    203.89    2     0     48    144
3     3.051571e+05    267.11    3     1     64    239
4     3.872464e+05    330.19    4     1     81    282
...            ...       ...  ...   ...    ...    ...
1374  4.459987e+07  91566.43  857   561  18362  62300
1375  4.462473e+07  91627.74  858   561  18380  62386
1376  4.463844e+07  91691.38  859   561  18392  62423
1377  4.473386e+07  91763.03  859   561  18404  62477
1378  4.474344e+07  91831.25  859   561  18416  62508

[1379 rows x 6 columns]

In [35]:
df.cummax().head(10)

           earn  height  sex  race  ed  age
0  79571.299011   73.89    0     0  16   49
1  96396.988643   73.89    1     0  16   62
2  96396.988643   73.89    1     0  16   62
3  96396.988643   73.89    1     1  16   95
4  96396.988643   73.89    1     1  17   95
5  96396.988643   73.89    1     1  17   95
6  96396.988643   73.89    1     1  17   95
7  96396.988643   73.89    1     1  17   95
8  96396.988643   73.89    1     2  17   95
9  96396.988643   73.89    1     2  17   95

In [13]:
df.corr() #전체간의 상관관계.

            earn    height        ed       age
earn    1.000000  0.291600  0.350374  0.074003
height  0.291600  1.000000  0.114047 -0.133727
ed      0.350374  0.114047  1.000000 -0.129802
age     0.074003 -0.133727 -0.129802  1.000000